{"calcular la suma": "La suma es una operación matemática que consiste en la adición de dos o más números.", "calcular la resta": "La resta es una operación matemática que consiste en la sustracción de un número de otro.", "calcular la multiplicación": "La multiplicación es una operación matemática que consiste en la suma repetida de un número varias veces.", "calcular la división": "La división es una operación matemática que consiste en repartir una cantidad en partes iguales.", "calcular el área del círculo": "El área de un círculo se calcula mediante la fórmula: A = π * r^2, donde π es pi y r es el radio del círculo.", "calcular el área del triángulo": "El área de un triángulo se calcula mediante la fórmula: A = (base * altura) / 2.", "calcular el área del cuadrado": "El área de un cuadrado se calcula mediante la fórmula: A = lado^2.", "calcular el área del rectángulo": "El área de un rectángulo se calcula mediante la fórmula: A = largo * ancho.", "calcular el área del trapecio": "El área de un trapecio se calcula mediante la fórmula: A = ((base mayor + base menor) * altura) / 2.", "calcular la presión": "La presión se calcula mediante la fórmula: P = F / A, donde P es la presión, F es la fuerza y A es el área sobre la que actúa la fuerza.", "calcular la velocidad": "La velocidad se calcula mediante la fórmula: v = d / t, donde v es la velocidad, d es la distancia y t es el tiempo.", "calcular la densidad": "La densidad se calcula mediante la fórmula: p = m / V, donde p es la densidad, m es la masa y V es el volumen.", "calcula: supongamos que tienes un fluido que fluye a través de una tubería horizontal. en un punto 1, la velocidad del fluido es de 3 m/s, la presión es de 6000 pa y la altura es de 8 m. en un punto 2, la velocidad del fluido disminuye a 2 m/s. ¿cuál será la presión en el punto 2 si la altura sigue siendo la misma? y me salio \"agregar respuesta\"\n\n": "El principio de Bernoulli establece que en un flujo de fluido constante, la suma de la presión, la energía cinética y la energía potencial por unidad de volumen permanece constante. Puede calcular la presión en un punto 2 utilizando la siguiente fórmula:\n\nP2 = P1 + 0.5 * p * (v1^2 - v2^2) + p * g * (h1 - h2)\n\nDonde:\nP2 = Presión en el punto 2\nP1 = Presión en el punto 1\np = Densidad del fluido\nv1 = Velocidad en el punto 1\nv2 = Velocidad en el punto 2\ng = Aceleración debida a la gravedad\nh1 = Altura en el punto 1\nh2 = Altura en el punto 2", "supongamos que tienes un fluido que fluye a través de una tubería horizontal. en un punto 1, la velocidad del fluido es de 3 m/s, la presión es de 6000 pa y la altura es de 8 m. en un punto 2, la velocidad del fluido disminuye a 2 m/s. ¿cuál será la presión en el punto 2 si la altura sigue siendo la misma?": "El principio de Bernoulli establece que en un flujo de fluido constante, la suma de la presión, la energía cinética y la energía potencial por unidad de volumen permanece constante. Puede calcular la presión en un punto 2 utilizando la siguiente fórmula:\n\nP2 = P1 + 0.5 * p * (v1^2 - v2^2) + p * g * (h1 - h2)\n\nDonde:\nP2 = Presión en el punto 2\nP1 = Presión en el punto 1\np = Densidad del fluido\nv1 = Velocidad en el punto 1\nv2 = Velocidad en el punto 2\ng = Aceleración debida a la gravedad\nh1 = Altura en el punto 1\nh2 = Altura en el punto 2", "como se dice a en mayusculas\n": "A", "como se dice b en mayusculas\n": "B", "como se dice c en mayusculas\n": "C", "quien es goku": "el mejor saiyan y Dios de la historia", "¡Bienvenido! Haz una pregunta. Si es un problema físico, pon 'calcula' al principio.": "quien es goku", "quien es naruto": "el peor ninja de todos", "quiero informacion": "En la implementación actual, cuando haces una pregunta relacionada con el principio de Bernoulli, el programa reconoce la pregunta al buscar la frase clave \"principio de bernoulli\" en la pregunta que ingresaste. Si la pregunta contiene esa frase clave, el programa asume que estás buscando una respuesta relacionada con el principio de Bernoulli y ejecutará la función resolver_problema_bernulli().\n\nPor ejemplo, si haces una pregunta como esta:\n\n\"Explícame el principio de Bernoulli\"\n\nEl programa debería reconocer la frase \"principio de Bernoulli\" y proporcionar una respuesta que explique el principio. Sin embargo, si deseas que el programa resuelva un problema específico utilizando el principio de Bernoulli, debes incluir los detalles relevantes del problema en tu pregunta. Por ejemplo:\n\n\"Un fluido fluye a través de una tubería horizontal. En un punto 1, la velocidad del fluido es de 3 m/s, la presión es de 6000 Pa y la altura es de 8 m. En un punto 2, la velocidad del fluido disminuye a 2 m/s. ¿Cuál será la presión en el punto 2 si la altura sigue siendo la misma? Aplica el principio de Bernoulli para resolverlo.\"\n\nDe esta manera, el programa reconocerá que estás buscando resolver un problema utilizando el principio de Bernoulli y proporcionará tanto la respuesta como la fórmula asociada en la ventana de respuestas largas. Ademas recuerda que para preguntas o cosas cotidianas pon quiero un auxiliar antes de lo que pidas, por ejemplo \"informacion\" te respondera lo mismo pero si le dices \"quiero informacion\" si que te dara el de agregar respuesta.", "/hola": "¿Que tal, como estas? ¡Estoy aqui para servirte!", "dame mas informacion": "Por ejemplo, si haces una pregunta como esta:\n\n\"Explícame el principio de Bernoulli\"\n\nEl programa debería reconocer la frase \"principio de Bernoulli\" y proporcionar una respuesta que explique el principio. Sin embargo, si deseas que el programa resuelva un problema específico utilizando el principio de Bernoulli, debes incluir los detalles relevantes del problema en tu pregunta. Por ejemplo:\n\n\"Un fluido fluye a través de una tubería horizontal. En un punto 1, la velocidad del fluido es de 3 m/s, la presión es de 6000 Pa y la altura es de 8 m. En un punto 2, la velocidad del fluido disminuye a 2 m/s. ¿Cuál será la presión en el punto 2 si la altura sigue siendo la misma? Aplica el principio de Bernoulli para resolverlo.\"\n\nDe esta manera, el programa reconocerá que estás buscando resolver un problema utilizando el principio de Bernoulli."}